"""
힙 자료구조
- 우선순위 큐 를 구현하기 위해 사용하는 자료구조
    * 우선순위 큐: 우선순위가 가장 높은 데이터를 가장 먼저 삭제
- 파이썬에서 우선순위 큐가 필요할 때, PriorityQueue 또는 heapq 를 사용할 수 있는데, 이 두 라이브러리는 모두 우선순위 큐 기능을 지원한다.
- 일반적으로 heapq가 더 빠르게 동작하기 때문에, 수행시간이 제한된 환경에서는 heapq를 사용하는 것을 권장한다.
- 대부분의 프로그래밍 언어에서는 우선순위 큐 라이브러리에 데이터 묶음을 넣으면, 첫 번째 원소를 기준으로 우선순위를 설정한다.
- 우선순위 큐를 구현할 때는 내부적으로 최소 힙 혹은 최대 힙을 이용한다.
    - 최소 힙: 값이 낮은 데이터가 먼저 삭제
    - 최대 힙: 값이 높은 데이터가 먼저 삭제

- 파이썬에서는 기본적으로 최소 힙 구조를 이용하는데, 다익스트라 최단 경로 알고리즘에서는 비용이 적은 노드를 우선하여 방문하므로 그대로 사용하면 된다.
- 최소 힙을 최대 힙처럼 사용하기 위해선 일부러 우선순위에 해당하는 값에 음수 부호(-)를 붙여서 넣었다가, 나중에 우선순위 큐에서 꺼낸 다음에 다시 음수 부호(-)를 붙여서 원래 값으로 돌리는 방식을 사용할 수 있다.
"""