"""
계수 정렬
: 특정한 조건이 부합할 때만 사용가능하지만, 매우 빠른 정렬 알고리즘이다.
- 데이터의 크기 범위가 제한되어 정수 형태로 표현할 수 있을 때만 사용 가능
- 일반적으로 가장 큰 데이터와 가장 작은 데이터의 차이가 1,000,000 을 넘지 않을 때 효과적으로 사용 가능
  ex) 0 이상 100 이하인 성적 데이터를 정렬할 때
- 또한 동일한 값을 가지는 데이터가 여러개 등장할 때 적합
- 비교 기반의 정렬 알고리즘이 아니다.
- 계수 정렬을 이용할 때는 '모든 범위를 담을 수 있는 크기의 리스트(배열)를 선언해야한다.
  -> 만약 가장 큰 데이터와 가장 작은 데이터의 차이가 1,000,000 이라면, 총 1,000,001개의 데이터가 들어갈 수 있는 리스트를 초기화해야 한다.
     (1을 더해주는 이유는 0 부터 1,000,000까지 총 1,000,001 개의 수가 존재하기 때문)
- 일반적으로 별도의 리스트를 선언하고 그 안에 정렬에 대한 정보를 담는다.
- 시간 복잡도 : O(N + K)   N - 데이터 개수, K - 데이터 중 최대값, 데이터는 모두 양수
"""

# 모든 원소의 값이 0보다 크거나 같다고 가정
array = [7, 5, 9, 0, 3, 1, 6, 2, 9, 1, 4, 8, 0, 5, 2]

# 모든 범위를 포함하는 리스트 선언 (모든 값은 0으로 초기화)
count = [0] * (max(array) + 1)

for i in range(len(array)):
    count[array[i]] += 1    # 각 데이터에 해당하는 인덱스의 값 증가

for i in range(len(count)):    # 리스트에 기록된 정렬 정보 확인
    for j in range(count[i]):
        print(i, end=" ")