"""
삽입 정렬
: 특정한 데이터를 적절한 위치에 '삽입'한다는 의미에서 삽입 정렬이다.
- 필요할 때만 위치를 바꾸므로 '데이터가 거의 정렬되어 있을 때' 매우 효과적 (퀵 정렬보다도 빠름)
- 선택 정렬은 현재 데이터의 상태과 관계없이 무조건 모든 원소를 비교하고 위치를 바꾸는 반면, 삽입 정렬은 그렇지 않다.
- 삽입 정렬은 특정한 데이터가 적절한 위치에 들어가기 이전에, 그 앞까지의 데이터는 이미 정렬되어있다고 가정한다.
- 시간 복잡도 : O(N)
"""

array = [7, 5, 9, 0, 3, 1, 6, 2, 4, 8]

for i in range(1, len(array)):
    for j in range(i, 0, -1):    # 인덱스 i 부터 1까지 감소하며 반복하는 문법
        if array[j] < array[j - 1]:    # 한 칸씩 왼쪽으로 이동
            array[j] , array[j - 1] = array[j - 1], array[j]
        else:    # 자기보다 작은 데이터를 만나면 그 위치에서 멈춤
            break
